gymmethod/frontend/models/SignupForm.php

    public function signup()
    {
        if ($this->validate()) {
            $user = new User();
            $user->username = $this->username;
            $user->email = $this->email;
            $user->setPassword($this->password); // generate hash for password hash field
            $user->generateAuthKey(); // auth key field
            $user->save(false);
---
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `verification_token`, `status`, `created_at`, `updated_at`) VALUES ('funcionario', 'funcionario@gmail.com', '$2y$13$nSqkw.U6JT3W.tbo1miD9uJtnoBLfJXvEDpXowuLgZP0RxGjvQu56', 'WM394HF_Ob5QRGb_YmPH5Gp1pt0gMcbw', 'wYW5OAAcTxBSpVG83RCMs88TrG4IgTmb_1666786365', 9, 1666786365, 1666786365)